<?php

namespace Database\Seeders;

use App\Enums\ProductCategory;
use App\Models\Product;
use App\Models\ProductText;
use Illuminate\Database\Seeder;

class ProductsSeeder extends Seeder
{
	protected $products = [
		// KC
		[
			'slug' => 'kc_3537',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_3537',
					'name' => 'ПРЕС КС3537 ДВОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Прес призначений для виготовлення з листового матеріалу середніх великих деталей, що вимагають вирубки, гнуття, формовки, неглибокого витягування та інших операцій холодного штампування.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '5,0 / 500'],
						['name' => 'Хід повзуна,мм', 'value' => '250'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '32'],
						['name' => 'Частота поодиноких включень,1/хв', 'value' => '20'],
						['name' => 'Відстань між столом і повзуном в його нижньому положенні, мм', 'value' => '750'],
						['name' => 'Товщина підштампової плити**, мм', 'value' => '220'],
						['name' => 'Зусилля верхнього виштовхувача, т.с.', 'value' => '40'],
						['name' => 'Сумарне зусилля пневмоподушок*, т.с.', 'value' => '60'],
						['name' => 'Робочий хід пневмоподушок, мм', 'value' => '120'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '250'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '2500x1400'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '2500x1300'],
						['name' => 'Розмір вікон в стійках (ширина х висота), мм', 'value' => '1320х800'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '47,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '5640x3500x6475'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '86500'],
					],
					'notes' => [
						'* Діаметр отвору в столі і розташування в столі, можливе згідно технічного завдання Замовника',
						'** Повзун і підштампова плита, можливо виконати згідно з ескізу Замовника',
					],
				],
			],
		],
		[
			'slug' => 'kc_3036',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_3537',
					'name' => 'Прес КС3036',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '3500'],
						['name' => 'Хід повзуна,мм', 'value' => '65'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '21'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '600'],
						['name' => 'Відстань між столом і повзуном в його нижньому положенні, мм', 'value' => '750'],
						['name' => 'Товщина плити, мм', 'value' => '110'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '100'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '2100х600'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1700х450'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '33,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2900x3300x3615'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '2750'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2124',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2124',
					'name' => 'ПРЕС КС2124 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ ОДНОСТОЯКОВИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '250'],
						['name' => 'Хід повзуна,мм', 'value' => '0...90'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '160'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '255'],
						['name' => 'Товщина плити, мм', 'value' => '75'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '55'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '500x350'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '350x280'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '2.2'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '830x1400x2200'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '1800'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2126',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2126',
					'name' => 'ПРЕС КC2126 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => '
					Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування.
					Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.
					',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '400'],
						['name' => 'Хід повзуна,мм', 'value' => '0...90'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '130'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '360'],
						['name' => 'Товщина плити, мм', 'value' => '80'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '65'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800x500'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '620x470'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '4,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '1500x1000x2300'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '3200'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2128',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2128',
					'name' => 'ПРЕС КC2128 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => 'Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування. Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '630'],
						['name' => 'Хід повзуна,мм', 'value' => '10...130'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '130'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '405'],
						['name' => 'Товщина плити, мм', 'value' => '85'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '80'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '900x560'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '680x500'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '7,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '1120x1650x2480'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '5760'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2132',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2132',
					'name' => 'ПРЕС КC2132 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => 'Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування. Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '1600'],
						['name' => 'Хід повзуна,мм', 'value' => '20...180'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '60'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '530'],
						['name' => 'Товщина плити, мм', 'value' => '110'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '120'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1120x750'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '900x650'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '15,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2085x1400x3020'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '11200'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2130',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2130',
					'name' => 'ПРЕС КC2130 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => 'Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування. Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '1000'],
						['name' => 'Хід повзуна,мм', 'value' => '20...180'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '72'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '480'],
						['name' => 'Товщина плити, мм', 'value' => '100'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '100'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000x670'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '780x570'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '10,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '1925x1285x2880'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '9500'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_2134',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_2134',
					'name' => 'ПРЕС КC2134 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ З ПЕРПЕНДИКУЛЯРНИМ ВАЛОМ',
					'description' => 'Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування. Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '20...220'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '50'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '580'],
						['name' => 'Товщина плити, мм', 'value' => '110'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '125'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1400x900'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1100x800'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2435x1615x3240'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '17900'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kc_3135',
			'category' => ProductCategory::PRESS_KC,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kc_3135',
					'name' => 'ПРЕС КC3135 ДВОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Наявність 8-ми напрямних забезпечує високу геометричну точність преса. Завдяки збільшеної робочій зоні на пресі можна виконувати багатоперехідне послідовне штампування. Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '3150'],
						['name' => 'Хід повзуна,мм', 'value' => '250'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '40'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '730'],
						['name' => 'Товщина плити, мм', 'value' => '140'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '250'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '2500x1200'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '2240x1100'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2800x2725x3460'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '30000'],
					],
					'notes' => [],
				],
			],
		],

		// KT
		[
			'slug' => 'kt_2124',
			'category' => ProductCategory::PRESS_KT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kt_2124',
					'name' => 'ПРЕС КT2124 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '10000'],
						['name' => 'Хід повзуна,мм', 'value' => '170'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '32'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '610'],
						['name' => 'Товщина плити, мм', 'value' => '140'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '16'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800x800'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '740x740'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2950x1950x4090'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '25000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kt_2126',
			'category' => ProductCategory::PRESS_KT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kt_2126',
					'name' => 'ПРЕС КT2126 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '400'],
						['name' => 'Хід повзуна,мм', 'value' => '10...110'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '130'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '355'],
						['name' => 'Товщина плити, мм', 'value' => '80'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '65'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '650x460'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '400x300'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '3,2'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '1400x1000x2480'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '3380'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kt_2130',
			'category' => ProductCategory::PRESS_KT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kt_2130',
					'name' => 'ПРЕС КT2130 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '1000'],
						['name' => 'Хід повзуна,мм', 'value' => '20...180'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '71'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '480'],
						['name' => 'Товщина плити, мм', 'value' => '100'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '100'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000x670'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '650x550'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '10,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '1950x1340x3260'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '9900'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kt_8336',
			'category' => ProductCategory::PRESS_KT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kt_8336',
					'name' => 'ПРЕС КТ8336 ХОЛОДНОШТАМПУВАЛЬНИЙ КРИВОШИПНО-КОЛІННИЙ ЧЕКАННИЙ ПРОСТОЇ ДІЇ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '4000'],
						['name' => 'Хід повзуна,мм', 'value' => '130'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '50'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '475'],
						['name' => 'Товщина плити, мм', 'value' => '100'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '12'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '500x500'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '500x500'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2120x1435x2860'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '9100'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kt_8340',
			'category' => ProductCategory::PRESS_KT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kt_8340',
					'name' => 'ПРЕС КТ8340 ХОЛОДНОШТАМПУВАЛЬНИЙ КРИВОШИПНО-КОЛІННИЙ ЧЕКАННИЙ ПРОСТОЇ ДІЇ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '10000'],
						['name' => 'Хід повзуна,мм', 'value' => '170'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '32'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '610'],
						['name' => 'Товщина плити, мм', 'value' => '140'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '16'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800x800'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '740x740'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2950x1950x4090'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '25000'],
					],
					'notes' => [],
				],
			],
		],

		// KG
		[
			'slug' => 'kg_5530',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_5530',
					'name' => 'ПРЕС КГ5530 ОДНОКРИВОШИПНИЙ ДВІЙНОЇ ДІЇ ЗАКРИТИЙ',
					'description' => 'На пресі, крім глибокої витяжки, можна одночасно виконувати вирубку по контуру. Для забезпечення притискання заготовки при витяжці і виштовшування готового виробу зі штампу, після закінчення технологічної операції, прес може оснащуватись гідропневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '100 / 63'],
						['name' => 'Хід повзуна,мм', 'value' => '400 / 250'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '20, 25, 30'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '560 / 500'],
						['name' => 'Товщина плити, мм', 'value' => '120'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '120х120'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800x800'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '500x500, 800х1020'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2400x2770x5350'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '21000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kg_2134',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_2134',
					'name' => 'ПРЕС КГ2134 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '25...200'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '61'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '560'],
						['name' => 'Товщина плити, мм', 'value' => '125'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '140'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1120x750'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '860x540'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2700x2500x4300'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '21800'],
					],
					'notes' => [
						'Прес є базовим для автоматизованого комплекса обладнання для холодного штампування деталей з листового матеріалу.',
					],
				],
			],
		],
		[
			'slug' => 'kg_2132',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_2132',
					'name' => 'ПРЕС КГ2132 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ВІДКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '1600'],
						['name' => 'Хід повзуна,мм', 'value' => '25...160'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '71'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '480'],
						['name' => 'Товщина плити, мм', 'value' => '110'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '120'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000x670'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '580x460'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '16,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2100x2340x3700'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '12300'],
					],
					'notes' => [
						'Прес є базовим для автоматизованого комплекса обладнання для холодного штампування деталей з листового матеріалу.',
					],
				],
			],
		],
		[
			'slug' => 'kg_9534',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_9534',
					'name' => 'ПРЕС КГ9534 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '320'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '45'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '530'],
						['name' => 'Товщина плити, мм', 'value' => '140'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '140'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800x800'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '670x630'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2400x2500x4850'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '18600'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kg_2540',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_2540',
					'name' => 'ПРЕС КГ2540',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '10000'],
						['name' => 'Хід повзуна,мм', 'value' => '400'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '20'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '730'],
						['name' => 'Товщина плити, мм', 'value' => '260'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '200'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1250x1250'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1265x1250'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '90,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '4310x3870x6790'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '78000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kg_9536',
			'category' => ProductCategory::PRESS_KG,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kg_9536',
					'name' => 'ПРЕС КГ9536 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ ОБРІЗНИЙ',
					'description' => 'Конструкція преса передбачає можливість встановлення механізмів автоматичної подачі матеріала. Для забезпечення притискання листової заготовки при витяжці і виштовхуванні готового виробу зі штампу, після закінчення технологічної операції, прес може бути оснащений пневмоподушкою.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '4000'],
						['name' => 'Хід повзуна,мм', 'value' => '400'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '470'],
						['name' => 'Товщина плити, мм', 'value' => '140'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '160'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000x1000'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1000x1000'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '43,3'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '3480x3160x5942'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '32500'],
					],
					'notes' => [],
				],
			],
		],
		
		// KY
		[
			'slug' => 'ky_3535',
			'category' => ProductCategory::PRESS_KY,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'ky_3535',
					'name' => 'ПРЕС КУ3535 ДВОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ',
					'description' => 'Прес призначений для виготовлення з листового матеріалу середніх великих деталей, що вимагають вирубки, гнуття, формовки, неглибокого витягування та інших операцій холодного штампування.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '315'],
						['name' => 'Хід повзуна,мм', 'value' => '400'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '470'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '250'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '2500x1250'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1000x1000'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '47,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '4556x2900x5855'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '50900'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'ky_3537',
			'category' => ProductCategory::PRESS_KY,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'ky_3537',
					'name' => 'ПРЕС КУ3537 ДВОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ',
					'description' => 'Прес призначений для виготовлення з листового матеріалу середніх великих деталей, що вимагають вирубки, гнуття, формовки, неглибокого витягування та інших операцій холодного штампування.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '5,0 / 500'],
						['name' => 'Хід повзуна,мм', 'value' => '280'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Частота поодиноких включень,1/хв', 'value' => '16'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '570'],
						['name' => 'Товщина підштампової плити**, мм', 'value' => '220'],
						['name' => 'Зусилля верхнього виштовхувача, т.с.', 'value' => '40'],
						['name' => 'Сумарне зусилля пневмоподушок*, т.с.', 'value' => '55'],
						['name' => 'Робочий хід пневмоподушок, мм', 'value' => '100'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '100'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '2550x1320'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '2400x1300'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '45,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '3700x1700x5000'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '50000'],
					],
					'notes' => [
						'* Діаметр отвору в столі і розташування в столі, можливе згідно технічного завдання Замовника',
						'** Повзун і підштампова плита, можливо виконати згідно з ескізу Замовника',
					],
				],
			],
		],
		
		// KY
		[
			'slug' => 'ku_2534',
			'category' => ProductCategory::PRESS_KU,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'ku_2534',
					'name' => 'ПРЕС КИ2534 ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ',
					'description' => 'Прес призначений для холодного штампування металу.',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '200'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '45'],
						['name' => 'Найбільша відстань між підштамповою плитою і повзуном в його нижньому положенні і при найбільшому ході,мм', 'value' => '560'],
						['name' => 'Товщина підштампової плити, мм', 'value' => '140'],
						['name' => 'Сумарне зусилля пневмоподушок, т.с.', 'value' => '125'],
						['name' => 'Робочий хід пневмоподушок, мм', 'value' => '65'],
						['name' => 'Величина регулювання відстані між столом і повзуном, мм', 'value' => '140'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800х1050'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '800х630'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '25,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2190х1855х3690'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '12400'],
					],
					'notes' => [],
				],
			],
		],
		
		// KV
		[
			'slug' => 'kv_0038',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_0038',
					'name' => 'ПРЕС МЕХАНІЧНИЙ СЕРІЇ КВ0038 (КРИВОШИПНІ ХОЛОДНОГО)',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '630'],
						['name' => 'Хід повзуна,мм', 'value' => '300'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Закрита висота,мм', 'value' => '700'],
						['name' => 'Регулювання закритої висоти,мм', 'value' => '20'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1250х1250'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '1000х1140'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '3870х3150х5900'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '64000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_0036',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_0036',
					'name' => 'ПРЕС МЕХАНІЧНИЙ СЕРІЇ КВ0036 (КРИВОШИПНІ ХОЛОДНОГО)',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '4000'],
						['name' => 'Хід повзуна,мм', 'value' => '230'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Закрита висота,мм', 'value' => '700'],
						['name' => 'Регулювання закритої висоти,мм', 'value' => '16'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000х1250'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '900х940'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2600х2270х4400'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '37450'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_0034',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_0034',
					'name' => 'ПРЕС МЕХАНІЧНИЙ СЕРІЇ КВ0034 (КРИВОШИПНІ ХОЛОДНОГО)',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '200'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '40'],
						['name' => 'Закрита висота,мм', 'value' => '490'],
						['name' => 'Регулювання закритої висоти,мм', 'value' => '16'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800х800'],
						['name' => 'Розміри повзуна (ширина х глибина),мм', 'value' => '730х740'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2840х1950х4090'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '21500'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_2532',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_2532',
					'name' => 'ПРЕСС ОДНОШИПНИЙ ЗАКРИТИЙ КВ2532',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '1600'],
						['name' => 'Хід повзуна,мм', 'value' => '160'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '60'],
						['name' => 'Частота одиночних ходів повзуна,1/хв', 'value' => '30'],
						['name' => 'Хід повзуна до його крайнього нижнього положення, на якому прес розвиває номіняльне зусилля,мм', 'value' => '12'],
						['name' => 'Відстань між підштамповою плитою і повзуном в його нижньому положенні при верхньому положенні регулювання,мм', 'value' => '360'],
						['name' => 'Величина регулювання відстані між підштамповою плитою і повзуном,мм', 'value' => '120'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800х800'],
						['name' => 'Ширина вікон в стійках,мм', 'value' => '500'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '26,5'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2500х2700х4100'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '13500'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_2539',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_2539',
					'name' => 'ПРЕСС ОДНОШИПНИЙ ЗАКРИТИЙ КВ2539',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '800'],
						['name' => 'Хід повзуна,мм', 'value' => '400'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '30'],
						['name' => 'Частота одиночних ходів повзуна,1/хв', 'value' => '30'],
						['name' => 'Хід повзуна до його крайнього нижнього положення, на якому прес розвиває номіняльне зусилля,мм', 'value' => '12'],
						['name' => 'Відстань між підштамповою плитою і повзуном в його нижньому положенні при верхньому положенні регулювання,мм', 'value' => '850'],
						['name' => 'Величина регулювання відстані між підштамповою плитою і повзуном,мм', 'value' => '185'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1650х1250'],
						['name' => 'Розмір повзуна (ширина х глибина),мм', 'value' => '1250х1000'],
						['name' => 'Ширина вікон в стійках,мм', 'value' => '600'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '90,0'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2500х3800х7400'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '77000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_2538',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_2538',
					'name' => 'ПРЕС ОДНОКРИВОШИПНИЙ ПРОСТОЇ ДІЇ ЗАКРИТИЙ ЗУСИЛЛЯМ 6300 КН МОДЕЛІ КВ2538',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '6300'],
						['name' => 'Хід повзуна,мм', 'value' => '320'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '25'],
						['name' => 'Частота одиночних ходів повзуна,1/хв', 'value' => '19'],
						['name' => 'Хід повзуна до його крайнього нижнього положення, на якому прес розвиває номіняльне зусилля,мм', 'value' => '12'],
						['name' => 'Відстань між підштамповою плитою і повзуном в його нижньому положенні при верхньому положенні регулювання,мм', 'value' => '800'],
						['name' => 'Величина регулювання відстані між підштамповою плитою і повзуном,мм', 'value' => '180'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1250х1250'],
						['name' => 'Розмір повзуна (ширина х глибина),мм', 'value' => '1000х1000'],
						['name' => 'Ширина вікон в стійках,мм', 'value' => '870'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '50б2'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '3650х3100х6550'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_2536',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_2536',
					'name' => 'ПРЕСС ОДНОШИПНИЙ ЗАКРИТИЙ КВ2536',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '4000'],
						['name' => 'Хід повзуна,мм', 'value' => '250'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '32'],
						['name' => 'Частота одиночних ходів повзуна,1/хв', 'value' => '24'],
						['name' => 'Хід повзуна до його крайнього нижнього положення, на якому прес розвиває номіняльне зусилля,мм', 'value' => '12'],
						['name' => 'Відстань між підштамповою плитою і повзуном в його нижньому положенні при верхньому положенні регулювання,мм', 'value' => '510'],
						['name' => 'Величина регулювання відстані між підштамповою плитою і повзуном,мм', 'value' => '160'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '1000х1000'],
						['name' => 'Розмір повзуна (ширина х глибина),мм', 'value' => '800'],
						['name' => 'Ширина вікон в стійках,мм', 'value' => '600'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '43,3'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '3140х3470х5940'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '32000'],
					],
					'notes' => [],
				],
			],
		],
		[
			'slug' => 'kv_2534',
			'category' => ProductCategory::PRESS_KV,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'kv_2534',
					'name' => 'ПРЕСС ОДНОШИПНИЙ ЗАКРИТИЙ КВ2534',
					'description' => '',
					'characteristics' => [
						['name' => 'Номінальне зусилля, МН', 'value' => '2500'],
						['name' => 'Хід повзуна,мм', 'value' => '200'],
						['name' => 'Частота безперервних ходів повзуна,1/хв', 'value' => '45'],
						['name' => 'Частота одиночних ходів повзуна,1/хв', 'value' => '24'],
						['name' => 'Хід повзуна до його крайнього нижнього положення, на якому прес розвиває номіняльне зусилля,мм', 'value' => '12'],
						['name' => 'Відстань між підштамповою плитою і повзуном в його нижньому положенні при верхньому положенні регулювання,мм', 'value' => '420'],
						['name' => 'Величина регулювання відстані між підштамповою плитою і повзуном,мм', 'value' => '140'],
						['name' => 'Розмір стола (ширина х глибина),мм', 'value' => '800х800'],
						['name' => 'Розмір повзуна (ширина х глибина),мм', 'value' => '670х630'],
						['name' => 'Ширина вікон в стійках,мм', 'value' => '500'],
						['name' => 'Потужність головного двигуна,кВт', 'value' => '26,5'],
						['name' => 'Габаритні розміри преса, мм (довжина,ширина,висота)', 'value' => '2500х2700х4690'],
						['name' => 'Орієнтовна маса преса,кГ', 'value' => '18000'],
					],
					'notes' => [],
				],
			],
		],
		
		// BRICK_MACHINE
		[
			'slug' => 'b_80',
			'category' => ProductCategory::BRICK_MACHINE,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'b_80',
					'name' => 'МАШИНА БРИКЕТУВАЛЬНА В-80',
					'description' => 'Брикетувальна машина В-80 призначена для виготовлення брикетів із тирси, соняшникового лушпиння, а також подрібнених соломи, бадилля квасолі та кукурудзи, відходів переробки льону.',
					'characteristics' => [
						['name' => 'Продуктивність для соломи', 'value' => '800 кг/год'],
						['name' => 'Продуктивність для тирси', 'value' => '1200 кг/год'],
						['name' => 'Продуктивність для відходів переробки льону', 'value' => '1000 кг/год'],
						['name' => 'Продуктивність для відходів бадилля квасолі', 'value' => '1000 кг/год'],
						['name' => 'Продуктивність для соняшникового лушпиння', 'value' => '800 кг/год'],
						['name' => 'Діаметр брикету,мм', 'value' => '80'],
						['name' => 'Довжина брикету,мм', 'value' => '5...200'],
						['name' => 'Частота ходів повзуна,1/хв', 'value' => '218'],
						['name' => 'Потужність двигуна головного приводу,кВт', 'value' => '30,0'],
						['name' => 'Потужність двигунів (2 шт) подачі матеріалу,кВт', 'value' => '4,0'],
						['name' => 'Потужність двигунів (2 шт) відбору матеріалу,кВт', 'value' => '1,1'],
						['name' => 'Габаритні розміри, мм (довжина,ширина,висота)', 'value' => '2700х2400х1900'],
						['name' => 'Маса машини без напрямних для брикета,кГ', 'value' => '3600'],
						['name' => 'Маса напрямних для брикета (15м),кГ', 'value' => '570'],
					],
					'notes' => [
						'Машина працює в комплексі з механізмом подрібнення соломи (бадилля, відходів) або сушкою для тирси і механізмами подачі сировини в зону пресування.',
					],
				],
			],
		],

		// YVT
		[
			'slug' => 'yvt_200',
			'category' => ProductCategory::YVT,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'yvt_200',
					'name' => 'УСТАНОВКА ВДАВЛЮЮЧИХ ТЕХНОЛОГІЙ УВТ-200',
					'description' => "Установки вдавлюючих технологій (УВТ-200 - їх перша модифікація) - це нове високотехнологічне обладнання на будівельному ринку, призначене для безпечного зведення фундаментів, огорож, закріплення грунтових масивів, ін'єктування і ін. На основі статичного занурення і вилучення будівельних елементів. Характеризуються високою надійністю бокового захоплення при великих зусиллях вдавлення і вилучення (номінальне зусилля 200 тонн). Можливість роботи в режимі вдавлення і вилучення дозволяє значно розширити технологічні можливості установок. У деяких випадках використання УВТ не має альтернативи, наприклад, при роботі на грунтах з великими прошарками мулистих грунтів, на заражених грунтах, при зведенні аварійних дамб.",
					'characteristics' => [
						['name' => 'Електронна система управління', 'value' => 'ATMEL'],
						['name' => 'Гусеничний хід', 'value' => 'розбирається'],
						['name' => 'Зусилля вдавлення, номінальне, кГ', 'value' => '200000'],
						['name' => 'Зусилля вилучення, номінальне, кГ', 'value' => '200000'],
						['name' => 'Перетин занурюються елементів до, мм', 'value' => '550'],
						['name' => 'Електрична потужність, повна, кВт', 'value' => '72'],
						['name' => 'Електрична потужність, мінімальна, кВт', 'value' => '27'],
						['name' => 'Габаритні розміри, мм (довжина,ширина,висота)', 'value' => '6000x2450x3100'],
						['name' => 'Маса установки,кГ', 'value' => '22000'],
						['name' => 'Маса гусеничного ходу,кГ', 'value' => '30000'],
					],
					'notes' => [],
				],
			],
		],
		
		// solar
		[
			'slug' => 'solar',
			'category' => ProductCategory::SOLAR_SYSTEMS,
			'texts' => [
				[
					'locale' => 'uk',
					'sku' => 'solar',
					'name' => 'ПОВОРОТНІ СОНЯЧНІ БАТАРЕЇ ТА КАРКАСИ',
					'description' => 'Поворотні сонячні батареї, обладнані приводами з програмним забезпеченням, дозволяють здійснювати електропостачання, використовуючи енергію сонця. ',
					'characteristics' => [
						['name' => 'Потужність (Сонячні батареї 160)', 'value' => 'до 30 000 Вт пік'],
						['name' => 'Потужність (Сонячні батареї 220)', 'value' => 'до 40 000 Вт пік'],
						['name' => 'Потужність (Сонячні батареї 260)', 'value' => 'до 48 000 Вт пік'],
						['name' => 'Потужність (Сонячні батареї 300)', 'value' => 'до 53 000 Вт пік'],

						['name' => 'Площа (Сонячні батареї 160)', 'value' => '163 м2'],
						['name' => 'Площа (Сонячні батареї 220)', 'value' => '212,10 м2'],
						['name' => 'Площа (Сонячні батареї 260)', 'value' => '247,52 м2'],
						['name' => 'Площа (Сонячні батареї 300)', 'value' => '287,50 м2'],

						['name' => 'Кут нахилу (Сонячні батареї 160)', 'value' => '350'],
						['name' => 'Кут нахилу (Сонячні батареї 220)', 'value' => '300'],
						['name' => 'Кут нахилу (Сонячні батареї 260)', 'value' => '300'],
						['name' => 'Кут нахилу (Сонячні батареї 300)', 'value' => '300'],
					],
					'notes' => [
						'Необхідні параметри технічного завдання на будівництво станції сонячної генерації:',
						'Координати розміщення станції.',
						'Геологія місцевості розміщення станції (топографічна зйомка, геологічна структура, сейсмічність).',
						'Помісячний інсоляційний режим (сонячне опромінення) поверхні місцевості.',
						'Загальна площа і конфігурація земельної ділянки (схема генерального плану розміщення), її правовий статус (викопіювання кадастрового плану земель).',
						'Технічні параметри місцевої електромережі, до якої буде приєднуватися станція.',
					],
				],
			],
		],
	];

	public function run(): void
	{
		ProductText::query()->truncate();
		Product::query()->truncate();
		
		foreach ($this->products as $productData) {
			$product = new Product();
			$product->slug = $productData['slug'];
			$product->category = $productData['category'];
			$product->save();

			foreach ($productData['texts'] as $text) {
				$serviceText = new ProductText();
				$serviceText->locale = $text['locale'];
				$serviceText->sku = $text['sku'];
				$serviceText->name = $text['name'];
				$serviceText->description = $text['description'];
				$serviceText->characteristics = $text['characteristics'];
				$serviceText->notes = $text['notes'];
				$serviceText->product()->associate($product);
				$serviceText->save();
			}
		}
	}
}
