<?php

return [
	'about_first' => 'Изготовление брикетировочных машин, прессов, солнечных батарей и каркасов.',
	'about_second' => '"ВЕСТХИМ" специализируется на проектировании, изготовлении и ремонте механических прессов усилием от 250 до 4000 кН открытого и закрытого типа, простого и двойного действия, предназначенных для различных операций холодной штамповки.',
	'get_price' => 'Заказать калькуляцию',
	'working_hours' => 'Звоните по указанным номерам +38 (099) 20-24-697 или заполняйте электронную форму онлайн, и мы вам перезвоним.
						<br><br> Пн - Пт: <span class="text-right">09:00 - 18:00 </span>
						<br> Сб: <span class="text-right">09:00 - 16:00</span>',
];