<?php

return [
	'layout' => [
		'top_bar' => [
			'address' => 'Украина, 76495, г. Ивано-Франковск, ул. Автоливмашевская 1Б',
		]
	],
	'home' => [
		'call_to_us' => 'Звоните или заполняйте электронную форму онлайн, и мы вам перезвоним.',
		'feedback' => 'Связаться с нами',
		'features' => [
			'advantages' => 'Преимущества',
			'our_advantages' => 'Наши преимущества',
			'quality' => 'Соответствуем качеству ISO 9001:2018',
			'qa' => 'Контроль производства',
			'consulting' => 'Профессиональные консультации',
			'staff' => 'Компетентные специалисты',
			'we_offer' => 'Мы предлагаем',
			'we_offer_description' => 'Бесплатную калькуляцию производства, нового оборудования или ремонтных и модернизационных работ кузнечно-прессового и металлорежущего оборудования.',
			'for_organizations' => 'Заводам и организациям',
			'for_organizations_list' => [
				'1' => 'Короткие сроки изготовления',
				'2' => 'Лучшая цена-качество на рынке',
				'3' => 'Большой ассортимент',
				'4' => 'Индивидуальный подбор',
				'5' => 'Нестандартные решения',
			],
			'product_organizations' => 'Проектным организациям',
			'product_organizations_list' => [
				'1' => 'Компактное оборудование',
				'2' => 'Универсальность установок',
				'3' => 'Множество конфигураций размещения',
				'4' => 'Проекты без альтернативы',
				'5' => 'Программа лояльности',
			],
			'investors' => 'Инвесторам',
			'investors_list' => [
				'1' => 'Подбор оборудования',
				'2' => 'Консультации по проекту',
				'3' => 'Расчет жизненного цикла',
				'4' => 'Консультации концепции',
				'5' => 'Вентиляция помещений',
			],
		],
		'facts' => [
			'done_projects' => 'Выполнено проектов',
			'workers' => 'Сотрудников',
			'products_and_services' => 'Продуктов и услуг',
			'countries' => 'Стран',
		],
		'subscribe' => [
			'call_to_us' => 'Связаться с нами',
			'phone' => '<h4>+38 (050) 43-32-050</h4>',
			'leave_email' => 'Оставить email',
		],
	],
	'contacts' => [
		'call_to_us' => 'Звоните или заполняйте электронную форму онлайн, и мы вам перезвоним.',
		'feedback' => 'Связаться с нами',
		'our_information' => 'Наши контакты',
		'our_address' => 'Наш адрес',
		'our_phone' => 'Телефон',
		'address' => 'Украина, 76495, г. Ивано-Франковск, ул. Автоливмашевская 1Б',
		'phone' => '<h4>+38 099 20-24-697</h4>',
		'email' => 'Email',
		'name' => 'Имя',
		'message' => 'Сообщение',
		'send' => 'Отправить',
	],
	'faq' => [
		'questions' => [
			'1' => [
				'question' => 'Можно ли заказать калькуляцию?',
				'answer' => 'Да, можно. Бесплатная калькуляция производства, нового оборудования или ремонтных и модернизационных работ кузнечно-прессового и металлорежущего оборудования.'
			],
			'2' => [
				'question' => 'Как с вами связаться?',
				'answer' => 'Звоните по указанному номеру +38 099 20-24-697 или заполняйте электронную форму онлайн, и мы вам перезвоним.
                                Дополнительную информацию можно найти здесь - '
			],
			'3' => [
				'question' => 'Наши реквизиты?',
				'answer' => '"ВЕСТХИМ"
                                Украина, 76495, г. Ивано-Франковск, ул. Автоливмашевская
                                Приемная:
                                Телефон: +38 099 20-24-697'
			],
		],
	]
];