<?php

return [
	'home' => [
		'title' => 'Изготовление и ремонт механических прессов Ивано-Франковск, Украина — ВЕСТХИМ',
		'description' => 'ВЕСТХИМ специализируется на проектировании, изготовлении и ремонте механических прессов усилием от 250 до 4000 кН открытого и закрытого типов, простой и двойной действия',
		'keywords' => [
			'проектирование механических прессов',
			'изготовление механических прессов',
			'ремонт механических прессов',
			'изготовление брикетировочных машин',
			'изготовление каркасов',
		],
	],
	'products' => [
		'title' => 'Наши продукты — ВЕСТХИМ',
		'description' => 'ВЕСТХИМ специализируется на проектировании, изготовлении и ремонте механических прессов ✔️ Брикетировочные прессы ✔️ Механические прессы ✔️ Гидравлические прессы ✔️ Канализационные люки',
	],
	'services' => [
		'title' => 'Наши услуги — ВЕСТХИМ',
		'description' => 'ВЕСТХИМ предоставляет полный комплекс услуг ✔️ Фрезерные работы ✔️ Токарные работы ✔️ Сварочные работы ✔️ Изготовление деталей любой сложности',
	]
];