<?php

return [
	'home' => [
		'title' => 'Виготовлення і ремонт механічних пресів Івано-Франківськ, Україна — ВЕСТХІМ',
		'description' => 'ВЕСТХІМ спеціалізується на проектуванні, виготовленні і ремонті механічних пресів зусиллям від 250 до 4000 кН відкритого і закритого типів, простої і подвійної дії',
		'keywords' => [
			'проектування механічних пресів',
			'виготовлення механічних пресів',
			'ремонт механічних пресів',
			'виготовлення брикетувальних машин',
			'виготовлення каркасів',
		],
	],
	'products' => [
		'title' => 'Наші Продукти — ВЕСТХІМ',
		'description' => 'ВЕСТХІМ спеціалізується на проектуванні, виготовленні і ремонті механічних пресів ✔️ Брекетувальні преси ✔️ Механічні преси ✔️ Гідравлічні преси ✔️ Люки каналізаційні',
	],
	'services' => [
		'title' => 'Наші Послуги — ВЕСТХІМ',
		'description' => 'ВЕСТХІМ надає повний комплекс послуг ✔️ Фрезувальні роботи ✔️ Токарні роботи ✔️ Зварювальні роботи ✔️ Виготовлення деталей любої складності',
	]
];