<?php

return [
	'about_first' => 'Виготовлення брикетувальних машин, пресів, сонячних батарей та каркасів.',
	'about_second' => '"ВЕСТХІМ" спеціалізується на проектуванні, виготовленні і ремонті механічних пресів зусиллям від 250 до 4000 кН відкритого і закритого типів, простої і подвійної дії, призначених для різноманітних операцій холодної штамповки.',
	'get_price' => 'Замовити калькуляцію',
	'working_hours' => 'Телефонуйте за вказаними номерами  +38 (099) 20-24-697 або заповнюйте електронну форму онлайн і ми вам зателефонуємо самі.
						<br><br> Пн - Пт: <span class="text-right">09:00 - 18:00 </span>
						<br> Сб: <span class="text-right">09:00 - 16:00</span>',
	
];