<?php

return [
	'layout' => [
		'top_bar' => [
			'address' => 'Україна, 76495, м. Івано – Франківськ вул. Автоливмашівська1Б',
		]
	],
	'home' => [
		'call_to_us' => 'Телефонуйте або заповнюйте електронну форму онлайн і ми вам зателефонуємо самі.',
		'feedback' => 'Зв\'язатись з нами',
		'features' => [
			'advantages' => 'Переваги',
			'our_advantages' => 'Наші переваги',
			'quality' => 'Відповідаємо якості ISO 9001:2018',
			'qa' => 'Контроль виробництва',
			'consulting' => 'Професіональні консультації',
			'staff' => 'Компетентні спеціалісти',
			'we_offer' => 'Ми пропонуємо',
			'we_offer_description' => 'Безкоштовну калькуляцію виробництва, нового обладнання або ремонтних чи модернізаційних робіт ковальсько-пресового та металорізального обладнання.',
			'for_organizations' => 'Заводам і Організаціям',
			'for_organizations_list' => [
				'1' => 'Стислі терміни виготовлення',
				'2' => 'Найкраща ціна-якість на ринкуя',
				'3' => 'Великий асортимент',
				'4' => 'Індивідуальний підбір',
				'5' => 'Нестандартні рішення',
			],
			'product_organizations' => 'Проектним Організаціям',
			'product_organizations_list' => [
				'1' => 'Компактне обладання',
				'2' => 'Універсальність установо',
				'3' => 'Безліч конфігурацій розміщення',
				'4' => 'Проекти без альтернативи',
				'5' => 'Програма лояльності',
			],
			'investors' => 'Інвесторам',
			'investors_list' => [
				'1' => 'Підбір обладняння',
				'2' => 'Консультації по проекту',
				'3' => 'Розрахунок життєвого циклу',
				'4' => 'Консультації концепції',
				'5' => 'Вентиляції приміщень',
			],
		],
		'facts' => [
			'done_projects' => 'Виконано проектів',
			'workers' => 'Працівників',
			'products_and_services' => 'Продуктів і послуг',
			'countries' => 'Країн',
		],
		'subscribe' => [
			'call_to_us' => 'Зв\'язатись з нами',
			'phone' => '<h4>+38 099 20-24-697</h4>',
			'leave_email' => 'Залишити емейл',
		],
	],
	'contacts' => [
		'call_to_us' => 'Телефонуйте або заповнюйте електронну форму онлайн і ми вам зателефонуємо самі.',
		'feedback' => 'Зв\'язатись з нами',
		'our_information' => 'Наші контакти',
		'our_address' => 'Наша адреса',
		'our_phone' => 'Телефон',
		'address' => 'Україна, 76495, м. Івано – Франківськ вул. Автоливмашівська1Б',
		'phone' => '<h4>+38 099 20-24-697</h4>',
		'email' => 'Емейл',
		'name' => 'Ім\'я',
		'message' => 'Повідомлення',
		'send' => 'Надіслати',
	],
	'faq' => [
		'questions' => [
			'1' => [
				'question' => 'Чи можна замовити калькуляцію?',
				'answer' => 'Так можна. Безкоштовна калькуляція виробництва, нового обладнання або ремонтних чи модернізаційних робіт ковальсько-пресового та металорізального обладнання.'
			],
			'2' => [
				'question' => 'Як з вами зв\'язатись?',
				'answer' => 'Телефонуйте за вказаним номером +38 099 20-24-697 або заповнюйте електронну форму онлайн і ми вам зателефонуємо самі.
									Додатвкову інформаціб можна знайти тут - '
			],
			'3' => [
				'question' => 'Наші реквізити?',
				'answer' => '"ВЕСТХІМ"
									Україна, 76495, м. Івано–Франківськ вул. Автоливмашівська
									Приймальня:
									Телефон: +38 099 20-24-697'
			],
		],
	]
];